PANDAS DATAFRAME AND INDEX, INSERT COLUMNS AND APPLYING FUNCTION

In [32]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(['DL', 'UP', 'AP', 'TS'],index = [1,2,3,4])
df[1]=[100, 200, 300, 400]
df

    0    1
1  DL  100
2  UP  200
3  AP  300
4  TS  400

In [6]:
df.loc[1]
print(' loc is label based prints the index as 1 or 2 ')
df.loc[2]

0     UP
1    200
Name: 2, dtype: object

In [ ]:
print('specify the rows and colums on index number that is intiger based')
df.iloc[0]

In [8]:
print('slicing based can be done')
df.columns = ['cities','Active']
df.loc[df.Active>200]

slicing based can be done

  cities  Active
3     AP     300
4     TS     400

In [9]:
df.iloc[:,0]

1    DL
2    UP
3    AP
4    TS
Name: cities, dtype: object

 PANDAS DATAFRAME AND INDEX, INSERT COLUMNS AND APPLYING FUNCTION

In [28]:
d ={'Score1':[56,85,23,48,64,78],'Score2':[56,39,43,61,89,94]}
df= pd.DataFrame(d)

In [21]:
df

   Score1  Score2
0      56      56
1      85      39
2      23      43
3      48      61
4      64      89
5      78      94

In [29]:
print('using funtion to dataframes')
def adder(x,y):
    return(x+y)

using funtion to dataframes

In [30]:
print(df['Score1'].pipe(adder,2))

0    58
1    87
2    25
3    50
4    66
5    80
Name: Score1, dtype: int64

In [38]:
names ={1:['Alisa','Bobby','Catherine','Madonna','Rockey','Sebastian']}

In [39]:
names

{1: ['Alisa', 'Bobby', 'Catherine', 'Madonna', 'Rockey', 'Sebastian']}

In [37]:
print(df['Score1'].apply(np.mean))

0    56.0
1    85.0
2    23.0
3    48.0
4    64.0
5    78.0
Name: Score1, dtype: float64

In [45]:
d = {'Name':['Alisa','Bobby','Catherine','Madonna','Rockey','Sebastian','Alisa','Bobby','Catherine', 'Madonna','Rockey','Sebastian'],
    'Exam':['Semester1','Semester1','Semester1','Semester1','Semester1','Semester1','Semester2','Semester2','Semester2','Semester2','Semester2','Semester2'],
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science','Mathematics','Mathematics','Mathematics','Science','Science','Science'],
    'Score':[62,56,45,69,84,63,52,47,81,52,81,73]}

In [46]:
df = pd.DataFrame(d)
df

         Name       Exam      Subject  Score
0       Alisa  Semester1  Mathematics     62
1       Bobby  Semester1  Mathematics     56
2   Catherine  Semester1  Mathematics     45
3     Madonna  Semester1      Science     69
4      Rockey  Semester1      Science     84
5   Sebastian  Semester1      Science     63
6       Alisa  Semester2  Mathematics     52
7       Bobby  Semester2  Mathematics     47
8   Catherine  Semester2  Mathematics     81
9     Madonna  Semester2      Science     52
10     Rockey  Semester2      Science     81
11  Sebastian  Semester2      Science     73

In [48]:
df['Score'].groupby([df['Name'],df['Exam']]).sum()

Name       Exam
Alisa      Semester1    62
           Semester2    52
Bobby      Semester1    56
           Semester2    47
Catherine  Semester1    45
           Semester2    81
Madonna    Semester1    69
           Semester2    52
Rockey     Semester1    84
           Semester2    81
Sebastian  Semester1    63
           Semester2    73
Name: Score, dtype: int64

In [51]:
df.groupby(['Subject','Exam']).sum()

                       Score
Subject     Exam
Mathematics Semester1    163
            Semester2    180
Science     Semester1    216
            Semester2    206